In [3]:
import numpy as np
import pandas as pd

from pandas import Series,DataFrame

In [5]:
data = Series(["one","two",np.nan,"four"])

In [7]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [9]:
data.isnull() #TO FIIND OUT IS THERE ANY NULL VALUE PRESENT

0    False
1    False
2     True
3    False
dtype: bool

In [11]:
data.dropna() #TO DROP ALL THE NULL VALUES

0     one
1     two
3    four
dtype: object

In [17]:
df1 = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [23]:
df2 = df1.dropna()
df2               #IF ANY ROW IN THE DATASET HAAS A NULL VALUE THEN THE ENTIRE
                  #ROW WILL GET DROPPED

     0    1    2
0  1.0  2.0  3.0

In [27]:
df1.dropna(how = "all") #THIS WILL DROP ONLY THOSE ROWS WHICH WILL HAVE ALL 
                        #VALUES NULL

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [29]:
df1.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [37]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [39]:
dframe2.dropna(thresh = 2)
#THIS WILL DROP THE ROWS THAT WILL HAVE LESS THAN TWO DATAPOINTS

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [41]:
dframe2.dropna(thresh = 3)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0

In [43]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [45]:
dframe2.fillna(1)#TO FILL THE NULL VALUES

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [47]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [51]:
dframe2.fillna({0:0,1:1,2:2,3:3}) 
#TO FILL DIFFERENT VALUES IN DIFFERENT COLUMS,WE HAVE TO PASS A DICTIONARY

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [53]:
dframe2.fillna(0)

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0

In [55]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [57]:
dframe2.fillna(0,inplace = True)
#THIS WILL PERMANENTLY CHANGE THE NULL VALUE TO 0

In [59]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  2.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0